; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v2 - type_1 ?v1 - type_2)
 	      (pred_3 ?v6 - object ?v1 - type_2)
	      (pred_1 ?v2 - type_1 ?v7 - type_3)
	      (pred_2 ?v2 - type_1 ?v6 - object ?v7 - type_3))

   (:action op_3
       :parameters  (?v2 - type_1 ?v8 ?v3 - type_2)
       :precondition (and  (pred_4 ?v2 ?v8))
       :effect (and  (pred_4 ?v2 ?v3)
		     (not (pred_4 ?v2 ?v8))))

   (:action op_2
       :parameters (?v2 - type_1 ?v5 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v4) (pred_4 ?v2 ?v4) (pred_1 ?v2 ?v7))
       :effect (and (pred_2 ?v2 ?v5 ?v7)
		    (not (pred_3 ?v5 ?v4)) 
		    (not (pred_1 ?v2 ?v7))))

   (:action op_1
       :parameters (?v2 - type_1 ?v5 - object ?v4 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v5 ?v7) (pred_4 ?v2 ?v4))
       :effect (and (pred_3 ?v5 ?v4)
		    (pred_1 ?v2 ?v7)
		    (not (pred_2 ?v2 ?v5 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_10 obj_14 - type_1
obj_09 obj_11 obj_05 obj_12 - type_3
obj_01 obj_04 obj_13 obj_08 - type_2
obj_02 obj_03 obj_07 obj_06 - object)
(:init
(pred_4 obj_10 obj_01)
(pred_1 obj_10 obj_09)
(pred_1 obj_10 obj_11)
(pred_4 obj_14 obj_08)
(pred_1 obj_14 obj_05)
(pred_1 obj_14 obj_12)
(pred_3 obj_02 obj_08)
(pred_3 obj_03 obj_01)
(pred_3 obj_07 obj_01)
(pred_3 obj_06 obj_08)
)
(:goal
(and
(pred_3 obj_02 obj_08)
(pred_3 obj_03 obj_13)
(pred_3 obj_07 obj_13)
(pred_3 obj_06 obj_08)
)
)

(:constraints
  (always (not (pred_4 obj_10 obj_13)))
)
)

; plan
1. (op_2 obj_10 obj_03 obj_01 obj_11)
   deleted: (pred_3 obj_03 obj_01) (pred_1 obj_10 obj_11)
   added: (pred_2 obj_10 obj_03 obj_11)
   goals met: 2 of 4
2. (op_3 obj_14 obj_08 obj_01)
   deleted: (pred_4 obj_14 obj_08)
   added: (pred_4 obj_14 obj_01)
   goals met: 2 of 4
3. (op_2 obj_14 obj_07 obj_01 obj_12)
   deleted: (pred_3 obj_07 obj_01) (pred_1 obj_14 obj_12)
   added: (pred_2 obj_14 obj_07 obj_12)
   goals met: 2 of 4
4. (op_3 obj_14 obj_01 obj_13)
   deleted: (pred_4 obj_14 obj_01)
   added: (pred_4 obj_14 obj_13)
   goals met: 2 of 4
5. (op_1 obj_14 obj_07 obj_13 obj_12)
   deleted: (pred_2 obj_14 obj_07 obj_12)
   added: (pred_3 obj_07 obj_13) (pred_1 obj_14 obj_12)
   goals met: 3 of 4
6. (op_3 obj_14 obj_13 obj_01)
   deleted: (pred_4 obj_14 obj_13)
   added: (pred_4 obj_14 obj_01)
   goals met: 3 of 4
7. (op_1 obj_10 obj_03 obj_01 obj_11)
   deleted: (pred_2 obj_10 obj_03 obj_11)
   added: (pred_3 obj_03 obj_01) (pred_1 obj_10 obj_11)
   goals met: 3 of 4
8. (op_2 obj_14 obj_03 obj_01 obj_12)
   deleted: (pred_3 obj_03 obj_01) (pred_1 obj_14 obj_12)
   added: (pred_2 obj_14 obj_03 obj_12)
   goals met: 3 of 4
9. (op_3 obj_14 obj_01 obj_13)
   deleted: (pred_4 obj_14 obj_01)
   added: (pred_4 obj_14 obj_13)
   goals met: 3 of 4
10. (op_1 obj_14 obj_03 obj_13 obj_12)
   deleted: (pred_2 obj_14 obj_03 obj_12)
   added: (pred_3 obj_03 obj_13) (pred_1 obj_14 obj_12)
   goals met: 4 of 4
